Java-Web/bootstrap.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-03-22 周五 01:23 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Bootstrap</title>
<meta name="generator" content="Org mode">
<meta name="author" content="unname">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Bootstrap</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc4a5be1">1. Hello World</a></li>
<li><a href="#org0551263">2. 基础</a></li>
<li><a href="#org3056812">3. 组件</a></li>
<li><a href="#orgdb1176c">4. v3 vs v4</a></li>
</ul>
</div>
</nav>



<section id="outline-container-orgc4a5be1" class="outline-2">
<h2 id="orgc4a5be1"><span class="section-number-2">1</span> Hello World</h2>
<div class="outline-text-2" id="text-1">
<p>
首先，引入:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://cdn.bootcss.com/bootstrap/4.0.0/css/bootstrap.min.css"</span> <span class="org-variable-name">integrity</span>=<span class="org-string">"sha384-Gn5384xqQ1aoWXA+058RXPxPg6fy4IWvTNh0E263XmFcJlSAwiGgFAW/dAiS6JXm"</span> <span class="org-variable-name">crossorigin</span>=<span class="org-string">"anonymous"</span>&gt;

<span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">js </span><span class="org-comment-delimiter">--&gt;</span>
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://cdn.bootcss.com/jquery/3.2.1/jquery.slim.min.js"</span> <span class="org-variable-name">integrity</span>=<span class="org-string">"sha384-KJ3o2DKtIkvYIK3UENzmM7KCkRr/rE9/Qpg6aAZGJwFDMVNA/GpGFF93hXpG5KkN"</span> <span class="org-variable-name">crossorigin</span>=<span class="org-string">"anonymous"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://cdn.bootcss.com/popper.js/1.12.9/umd/popper.min.js"</span> <span class="org-variable-name">integrity</span>=<span class="org-string">"sha384-ApNbgh9B+Y1QKtv3Rn7W3mgPxhU9K/ScQsAP7hUibX39j7fakFPskvXusvfa0b4Q"</span> <span class="org-variable-name">crossorigin</span>=<span class="org-string">"anonymous"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://cdn.bootcss.com/bootstrap/4.0.0/js/bootstrap.min.js"</span> <span class="org-variable-name">integrity</span>=<span class="org-string">"sha384-JZR6Spejh4U02d8jOt6vLEHfe/JQGiRRSQQxSfFWpi1MquVdAyjUar5+76PVCmYl"</span> <span class="org-variable-name">crossorigin</span>=<span class="org-string">"anonymous"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
</pre>
</div>
</div>
</section>

<section id="outline-container-org0551263" class="outline-2">
<h2 id="org0551263"><span class="section-number-2">2</span> 基础</h2>
<div class="outline-text-2" id="text-2">
<p>
网站:
</p>
<ul class="org-ul">
<li>官网 <a href="http://getbootstrap.com/">http://getbootstrap.com/</a></li>
<li>中文网站 <a href="http://bootcss.com/">http://bootcss.com/</a></li>
</ul>

<p>
实现原理:
</p>
<ol class="org-ol">
<li>使用 <b>百分比/em/rem</b> 定义尺寸</li>
<li>网格系统（Grid System）概念的提出跟实现</li>
<li>媒体查询(@Media)</li>
</ol>

<p>
注意，如果要使用弹出 Model 等功能，需要引入相关 js，bootstrap.js 需要 jQuery 的支持
</p>
</div>
</section>

<section id="outline-container-org3056812" class="outline-2">
<h2 id="org3056812"><span class="section-number-2">3</span> 组件</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>表单/表格</li>
<li>导航栏</li>
<li>菜单</li>
<li>轮播</li>
<li>巨幕</li>
<li>alert/tip/popup</li>
<li>Modal</li>
<li>Progress</li>
<li>Card/Figure</li>
</ul>
</div>
</section>

<section id="outline-container-orgdb1176c" class="outline-2">
<h2 id="orgdb1176c"><span class="section-number-2">4</span> v3 vs v4</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>v4 大量使用了 flex 语法，api 更简洁，功能更强大</li>
<li>因为使用了 flex 语法，所以放弃了兼容一些旧的浏览器</li>
<li>v3 历史悠久，基于它的主题和插件更多</li>
<li>v4 代表着未来</li>
</ul>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: unname</p>
<p class="date">Created: 2019-03-22 周五 01:23</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
